{
  "Tips and Tricks": "Use the buttons at the bottom of the palette to paint two bases at once, rather than one at a time.<newline><newline>Click-and-drag paint whenever possible.<newline><newline>Check the shape map often; it will tell you what parts of the RNA need work. Switching back and forth between target and natural modes will then tell you what is going wrong.<newline><newline>Bases with a black key symbol are locked and cannot be changed.<newline><newline>Leave loops <yellow>yellow</yellow> except when painting boosts.\n",
  "The Four Bases": "Bases (also called nucleotides) are the building blocks of RNA. Each circle on VirtuaLab's RNA molecules represents one base.<newline><newline>The four bases are <yellow>Adenine (A)</yellow>, <blue>Uracil (U)</blue>, <red>Guanine (G)</red>, and <green>Cytosine (C)</green>. Select bases from the palette and click (or click and drag) the circles on the RNA. The sequence of nucleotide bases determines how RNA will fold.\n",
  "Moving and Magnifying RNA": "To move an RNA molecule around the screen, click and drag the background (the blue area with bubbles behind the RNA).<newline><newline>You can zoom in and out using the magnifying glass buttons at the bottom of the screen.\n",
  "Objectives": "The boxes in the upper left corner of the screen show your mission objectives. In order to solve a puzzle, you must turn all of these boxes green by meeting their requirements.<newline><newline>The objectives change based on natural mode, not target mode. So, if you paint an <yellow>A</yellow>-<blue>U</blue> bond in target mode, the objective may not count it until the <yellow>A</yellow>-<blue>U</blue> bonds correctly in natural mode.\n<newline> \n",
  "Click-and-Drag Painting": "Click on the first base you want to change. Then, holding down the mouse button, drag the cursor over all of the bases you want to change.\n",
  "Bonds": "The three bonds are:<newline><yellow>A</yellow>-<blue>U</blue><newline><blue>U</blue>-<red>G</red><newline><red>G</red>-<green>C</green><newline><newline>Bonded bases are next to each other in the palette.\n",
  "Stacks and Loops": "Stacks are lines of bonded bases.<newline><newline>Loops are circular and made of unbonded bases.\n",
  "Painting Pairs of Bases": "The buttons below the bases on the palette allow you to paint two bonded colors at the same time onto stacks.\n",
  "Bond Strength": "<red>G</red>-<green>C</green> is the strongest bond<newline><yellow>A</yellow>-<blue>U</blue> is medium<newline><blue>U</blue>-<red>G</red> is weakest\n",
  "Natural and Target Modes": "Target mode (target button) shows the shape you want to fold the RNA into. Natural mode (leaf button) shows how the RNA will actually fold based on how you've painted it.<newline><newline>Switching back and forth between these two modes can help you see where an RNA isn't folding correctly.\n",
  "Ends of Stacks": "The ends of stacks, where they meet loops, are the weakest points in an RNA. They usually need strong bonds to hold them together. Placing <red>G</red>-<green>C</green>s at the ends of stacks is a good strategy for starting puzzles.<newline><newline>Some puzzles will restrict the number of <red>G</red>-<green>C</green>s that you can use. In those cases, it's often best to place <yellow>A</yellow>-<blue>U</blue>s at the ends of stacks instead.\n",
  "Shape Guide": "The shape guide is the box at the top left part of the screen that shows the shape that you need to fold an RNA into. You can click on this box to see a larger version of it. Red areas are incorrect, and white areas are folding correctly. The shape guide turns green when all parts of the molecule have folded correctly.<newline><newline>Use the shape guide to figure out where you need to work on a molecule in order to get it to fold correctly.\n",
  "Placing A-U": "<yellow>A</yellow>-<blue>U</blue> bonds are of medium strength. They're good at holding the middle of stacks together. They can sometimes hold the ends of stacks together (however, <red>G</red>-<green>C</green> is better at that).<newline><newline><yellow>A</yellow>-<blue>U</blue>s are strongest when they “zipper,“ or alternate in direction.\n",
  "Slides": "Bonds can slide to the wrong bases when each side of a stack is one color. Sometimes, entire sections of an RNA will slide to each other, giving the RNA the wrong shape.<newline><newline>Fix slides by using the swap tool (the button to the right of the palette).\n",
  "Swap Tool": "The swap tool is the button to the right of the palette. It swaps the positions of two bases across from each other in a stack.\n",
  "Placing U-G": "<blue>U</blue>-<red>G</red> is the weakest bond. It often works in the middle of stacks and next to <red>G</red>-<green>C</green> bonds. When you must use <blue>U</blue>-<red>G</red> bonds, first stabilize the entire puzzle with <red>G</red>-<green>C</green> and/or <yellow>A</yellow>-<blue>U</blue> bonds. The target map will have a green check mark when the puzzle has been stabilized. Next, place <blue>U</blue>-<red>G</red> bonds one at a time in the middle of stacks, spacing them apart from each other. Check the target map after placing every <blue>U</blue>-<red>G</red>; if it turns red, undo that last bond and try again somewhere else.<newline><newline>When you place multiple <blue>U</blue>-<red>G</red>s in a row, they're stronger if they all go in the same direction, with blues on one side and reds on the other.\n",
  "Boosting Loops": "Loops can be strengthened using boosts. The most common loop boost is placing a <red>G</red> at the lowest numbered base next to a stack. There must be an unbonded <yellow>A</yellow> across the stack. Even though it isn't pictured, the <red>G</red> and <yellow>A</yellow> actually form a weak bond; the loop holds them far enough apart to make this possible.<newline><newline>A loop can usually be boosted multiple times if it has more than one stack coming out of it.\n",
  "Base Numbers": "The numbers next to the RNA count bases from the top of a strand to the bottom (when it is unpainted in natural mode). When RNA folds up, the numbers stay next to the same bases.\n",
  "Bulges": "Bulges are loops that always have exactly two adjacent stacks and one or more unbonded bases.<newline><newline>Bulges cannot be boosted.\n",
  "1-1 Loops": "Loops that have one loose nucleotide on each side are called 1-1 loops. They always have two stacks coming out at opposite sides. You can boost 1-1 loops by placing <red>G</red>s on the two unbonded bases. These <red>G</red>s strengthen the loop because they bond to each other. <red>G</red>s rarely bond; here, the 1-1 loop happens to hold them apart from each other at just the right distance to make this possible.\n",
  "Energy": "RNA folds into the state with the lowest energy. A loop with energy of -1 is more likely to fold than a loop with an energy of 2.<newline><newline>Energy is a powerful tool: it lets you see how your choices help the RNA fold.<newline><newline>Remember, negative numbers are better for an RNA. The colors are a helpful reminder - <green>green</green> numbers are strong, and <red>red</red> numbers are weak.<newline><newline>Energy only appears after you paint bonds.\n",
  "Switch Puzzles": "Switch puzzles fold into two different shapes. Switch RNAs change shape when they capture a molecule. However, the sequence of bases doesn't change. The challenge with these puzzles is to design a sequence of bases that works for both shapes.<newline><newline>Click the toggle above the natural/target mode buttons to switch between the two shapes (this toggle only appears on switch levels). The highlighting base tool is extremely useful when solving switch puzzles.\n",
  "Highlighting Bases": "Highlight specific bases by right-clicking them (command-click on a Mac). This will place a black circle around the base. This black circle stays on that base in natural mode and target mode and for both states of a switch puzzle. It's a useful tool when you're trying to understand which bases are stopping an RNA from folding correctly.\n"
}